AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректироватьНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

CommonModules/УчетДенежныхСредств/Ext/Module.bsl
#Область ОперационнаяКурсоваяРазница

Процедура СформироватьДвиженияОперационнаяКурсоваяРазница(ДополнительныеСвойства, Движения, Отказ, ПриходДенежныхСредств, Конвертация = Ложь) Экспорт
	
	ТаблицаДляРасчетаОперационныхКурсовыхРазниц = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДляРасчетаОперационныхКурсовыхРазниц;
	
	Если ТаблицаДляРасчетаОперационныхКурсовыхРазниц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыОперационнаяКурсоваяРазница(ТаблицаДляРасчетаОперационныхКурсовыхРазниц, Конвертация);
	
	Данные = Параметры.Данные[0]; 

	СчетУчетаДоходыОКР = ПланыСчетов.Хозрасчетный.ДоходыОтОперационныхКурсовыхРазниц;
	СчетУчетаУбыткиОКР = ПланыСчетов.Хозрасчетный.УбыткиОтОперационныхКурсовыхРазниц;
	
	// Валюта взаиморасчетов в валюте регламентированного учета. 
	Если Данные.ВалютаРасчетов = Данные.ВалютаРегламентированногоУчета Тогда 
		СуммаКурсовойРазницы = Данные.СуммаПлатежа * Данные.КурсВзаиморасчетовПоНацБанку / Данные.КратностьВзаиморасчетовПоНацБанку - Данные.СуммаВзаиморасчетов;
		
	// В документа в валюте регламентированного учета.				
	ИначеЕсли Данные.ВалютаДокумента = Данные.ВалютаРегламентированногоУчета Тогда
		СуммаКурсовойРазницы = Данные.СуммаПлатежа - Данные.СуммаВзаиморасчетов * Данные.КурсВзаиморасчетовПоНацБанку / Данные.КратностьВзаиморасчетовПоНацБанку;
		
	// Валюты отличны от валюты регламентированного учета.
	Иначе 
		СуммаКурсовойРазницы = Данные.СуммаПлатежа * Данные.КурсДокумента / Данные.КратностьДокумента - Данные.СуммаВзаиморасчетов * Данные.КурсВзаиморасчетовПоНацБанку / Данные.КратностьВзаиморасчетовПоНацБанку;
	КонецЕсли;				
	
	СчетРасчетовВалютный = НЕ Данные.ВалютаРасчетов = Данные.ВалютаРегламентированногоУчета;
	ДенежныйСчетВалютный = НЕ Данные.ВалютаДокумента = Данные.ВалютаРегламентированногоУчета;
	ОбаСчетаВалютные 	 = СчетРасчетовВалютный И ДенежныйСчетВалютный;
	
	Если Окр(СуммаКурсовойРазницы, 2) = 0 Тогда 
		Возврат;
		
	// Расход валюты, убыток
	ИначеЕсли НЕ ДенежныйСчетВалютный И СчетРасчетовВалютный И СуммаКурсовойРазницы < 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Ложь;
		Иначе
			Доход = Истина;                                                         
		КонецЕсли;
		
	// Расход валюты, доход		
	ИначеЕсли НЕ ДенежныйСчетВалютный И СчетРасчетовВалютный И СуммаКурсовойРазницы > 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Истина;
		Иначе
			Доход = Ложь;
		КонецЕсли;
		
	// Приход валюты, убыток	
	ИначеЕсли ДенежныйСчетВалютный И НЕ СчетРасчетовВалютный И СуммаКурсовойРазницы < 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Ложь;
		Иначе
			Доход = Истина;
		КонецЕсли;
		
	// Приход валюты, доход	
	ИначеЕсли ДенежныйСчетВалютный И НЕ СчетРасчетовВалютный И СуммаКурсовойРазницы > 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Истина;
		Иначе
			Доход = Ложь;
		КонецЕсли;
		
	// Валюта - Валюта, убыток	
	ИначеЕсли ДенежныйСчетВалютный И СчетРасчетовВалютный И СуммаКурсовойРазницы < 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Ложь;
		Иначе
			Доход = Истина;
		КонецЕсли;
		
	// Валюта - Валюта, доход		
	ИначеЕсли ДенежныйСчетВалютный И СчетРасчетовВалютный И СуммаКурсовойРазницы > 0 Тогда
		Если ПриходДенежныхСредств Тогда
			Доход = Истина;
		Иначе
			Доход = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	СтатьяДДСКурсоваяРазница = БухгалтерскийУчетСервер.СтатьяДДСКурсоваяРазница();
	СтатьяЗатратКурсоваяРазница = Справочники.СтатьиЗатрат.КурсовыеРазницы;
	
	Проводка = Движения.Хозрасчетный.Добавить();
	
	Проводка.Период      	= Данные.Период;
	Проводка.Организация 	= Данные.Организация;
	
	Если Доход Тогда
		Если ОбаСчетаВалютные ИЛИ ДенежныйСчетВалютный Тогда
			Проводка.СчетДт = Данные.ДенежныйСчет;
			Проводка.ВалютаДт = Данные.ВалютаДокумента;
		Иначе
			Проводка.СчетДт = Данные.СчетРасчетов;
			Проводка.ВалютаДт = Данные.ВалютаРасчетов;
		КонецЕсли;
		
		Проводка.СчетКт = СчетУчетаДоходыОКР;
		
		Если Конвертация Тогда
			Если ОбаСчетаВалютные ИЛИ ДенежныйСчетВалютный Тогда
				БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДенежныеСредства", Данные.КассаБанковскийСчетПриход);
			Иначе
				БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДенежныеСредства", Данные.КассаБанковскийСчетРасход);
			КонецЕсли;
			
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", СтатьяДДСКурсоваяРазница);	
		Иначе
			// Заполнение субконто в случае если СчетКт денежные средства. 
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДенежныеСредства", Данные.КассаБанковскийСчет);
			// Заполнение субконто в случае если СчетКт счет учета расчетов с контрагентом. 
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Данные.Контрагент);
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", Данные.ДоговорКонтрагента);
		КонецЕсли;
			
		Проводка.Содержание = НСтр("ru = 'Доходы от операционных курсовых разниц'");
		
	Иначе 
		Проводка.СчетДт = СчетУчетаУбыткиОКР;
		
		Если ОбаСчетаВалютные ИЛИ ДенежныйСчетВалютный Тогда
			Проводка.СчетКт = Данные.ДенежныйСчет;
			Проводка.ВалютаКт = Данные.ВалютаДокумента;
		Иначе
			Проводка.СчетКт = Данные.СчетРасчетов;
			Проводка.ВалютаКт = Данные.ВалютаРасчетов;
		КонецЕсли;
		
		Если Конвертация Тогда
			Если ОбаСчетаВалютные ИЛИ ДенежныйСчетВалютный Тогда
				БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДенежныеСредства", Данные.КассаБанковскийСчетПриход);
			Иначе
				БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДенежныеСредства", Данные.КассаБанковскийСчетРасход);
			КонецЕсли;
			
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", СтатьяДДСКурсоваяРазница);
		Иначе
			// Заполнение субконто в случае если СчетКт денежные средства. 
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДенежныеСредства", Данные.КассаБанковскийСчет);
			// Заполнение субконто в случае если СчетКт счет учета расчетов с контрагентом. 
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Данные.Контрагент);
			БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", Данные.ДоговорКонтрагента);
		КонецЕсли;	
			
		БухгалтерскийУчетСервер.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат", СтатьяЗатратКурсоваяРазница);
		
		Проводка.Содержание = НСтр("ru = 'Убытки от операционных курсовых разниц'");
	
	КонецЕсли;
	
	Проводка.Сумма = ?(СуммаКурсовойРазницы > 0, СуммаКурсовойРазницы, СуммаКурсовойРазницы * (-1));;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыОперационнаяКурсоваяРазница(ТаблицаДляРасчетаОперационныхКурсовыхРазниц, Конвертация)

	Параметры = Новый Структура;

	// Подготовка таблицы Параметры.ТаблицаДляРасчетаОперационныхКурсовыхРазниц

	СписокОбязательныхКолонок = ""
	+ "Период,"                         	// <Дата> - период движений - дата документа
	+ "Организация,"                    	// <СправочникСсылка.Организация> - организация
	+ "КассаБанковскийСчет,"     			// <СправочникСсылка.Касса>, <СправочникСсылка.БанковскиеСчета> - касса/банковский счет
	+ "ВалютаДокумента,"     				// <СправочникСсылка.Валюты> - валюта кассы/банка
	+ "ВалютаРегламентированногоУчета,"     // <СправочникСсылка.Валюты> - валюта регл.учета
	+ "ВалютаРасчетов,"           			// <СправочникСсылка.Валюты> - валюта взаиморасчетов	
	+ "КурсДокумента,"     					// <Число,10,4> - курс валюты документа
	+ "КратностьДокумента,"					// <Число,10,0> - кратность валюты документа
	+ "СчетРасчетов,"          				// <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом
	+ "ДенежныйСчет,"          				// <ПланСчетовСсылка.Хозрасчетный> - денежный счет учета
	+ "СуммаПлатежа,"           			// <Число,15,2> - сумма в валюте регламентированного учета
	+ "СуммаВзаиморасчетов," 				// <Число,15,2> - сумма в валюте взаиморасчетов
	+ "КурсВзаиморасчетовПоНацБанку,"     	// <Число,10,4> - курс валюты взаиморасчетов но НБКР
	+ "КратностьВзаиморасчетовПоНацБанку";	// <Число,10,0> - кратность валюты взаиморасчетов по НБКР
	
	Если Конвертация Тогда
		СписокОбязательныхКолонок = СписокОбязательныхКолонок
		+ ",КассаБанковскийСчетПриход"            	// <СправочникСсылка.Кассы> ИЛИ <СправочникСсылка.БанковскиеСчета> - касса или банковский счет прихода	
		+ ",КассаБанковскийСчетРасход";            	// <СправочникСсылка.Кассы> ИЛИ <СправочникСсылка.БанковскиеСчета> - касса или банковский счет расхода
		
	Иначе
		СписокОбязательныхКолонок = СписокОбязательныхКолонок
		+ ",Контрагент"            			// <СправочникСсылка.Контраегенты> - контрагент	
		+ ",ДоговорКонтрагента";            // <СправочникСсылка.ДоговорыКонтрагентов> - договор контрагента
	КонецЕсли;
	
	Параметры.Вставить("Данные",
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаДляРасчетаОперационныхКурсовыхРазниц, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

#КонецОбласти
